bricks/olymp/olymp/contest.kpml/2013.org
#+HTML_DOCTYPE: html5
#+OPTIONS: toc:nil num:nil ^:{} html5-fancy:t
#+MACRO: begin-block #+HTML: <div class="$1">
#+MACRO: end-block #+HTML: </div>

{{{begin-block(Page)}}}

* Открытая олимпиада КФМЛ «Командный турнир по программированию»

*27 октября 2013 года* состоялась XVI открытая олимпиада КФМЛ
«Командный турнир по программированию». Она проходила в один день и на
том же наборе задач, что и командный чемпионат школьников
Санкт-Петербурга по программированию.

По результатам олимпиады, пять первых команд получили право
участвовать во [[http://neerc.ifmo.ru/school/russia-team/index.html][Всероссийской командной]] олимпиаде школьников по
программированию, которая состоится 23-24 ноября 2013 года в
Санкт-Петербурге и Барнауле.

** Результаты

|-----+-------------------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+--------+-------|
|     | Команда                                                           | A   | B   | C   | D   | E   | F   | G   | H   | I   | J   | Задачи | Штраф |
|-----+-------------------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+--------+-------|
| <r> | <l>                                                               | <c> | <c> | <c> | <c> | <c> | <c> | <c> | <c> | <c> | <c> | <c>    | <c>   |
|  12 | Диванная аналитика (Волостнов, Мингалиев, Чернега), Казань        | +2  | +   | +   | +   | +1  | +   | +   | +2  | +1  | +   | 10     | 1113  |
|   7 | LI2 - 1 (Архипов, Корчагин, Сабирзянов), Казань                   | +2  | +   | +   | +   | +   | +2  |     | +4  |     | +   | 8      | 948   |
|  17 | Лицей КФУ - 1 (Муравьев, Сайфутдинов, Яровиков), Казань           | +   | +   | +   | +   | +   | +1  |     | -7  |     | +10 | 7      | 865   |
|  11 | Вятский тессеракт (Будин, Бураков, Кайсин), Киров+Кирово-Чепецк   | +   | +   | +   | +4  | +6  | +   |     | -4  |     | -2  | 6      | 1065  |
|   4 | KRFMLI#1 (Мальцев, Зиновьева, Рябинина), Сыктывкар                | +   | +   |     | +1  | +   | +   |     | -4  |     |     | 5      | 344   |
|  19 | Лицей КФУ - 3 (Захаров, Жданова, Китаева), Казань                 |     | +1  | -13 | +3  | +3  | +   |     |     |     |     | 4      | 578   |
|  18 | Лицей КФУ - 2 (Лагутин, Сайфутдинов, Сахабиев), Казань            |     | +   | +   | +3  | -10 | +4  |     |     |     |     | 4      | 652   |
|   5 | KRFMLI#2 (Тупикина, Мишенёв, Серов), Сыктывкар                    |     | +   | -3  | +4  | +2  | +5  |     | -5  |     |     | 4      | 812   |
|   8 | LI2 - 2 (Абдумуталов, Колычев, Мустафин), Казань                  | -2  | +   | -3  | -3  | +   | +   |     |     |     |     | 3      | 184   |
|  16 | Лицей 33 (Шарифзянов, Ибрагимов, Проскуряков), Казань             |     | +   |     | +2  | -3  | +   |     |     |     |     | 3      | 299   |
|   1 | Gym122 (Кузьмин, Галеева, Староверов), Казань                     |     | +   |     | +   | -8  | +5  |     |     | -2  |     | 3      | 406   |
|   2 | ION (Шелестов, Захаров, Астафьев), Казань                         |     | +2  |     | -5  | -2  | +1  |     |     |     |     | 2      | 145   |
|   6 | LI - 7 (Азимуратов, Гумеров, Кидрачёв), Казань                    |     | +   |     | -8  | -4  | +3  |     |     |     |     | 2      | 213   |
|  13 | Картошка (Радаев, Васенин, Гурьев), Киров                         |     | +   |     |     |     | +9  |     | -5  |     |     | 2      | 617   |
|  10 | Акбуре (Хайруллин, Султанов, Хайруллин), Казань                   |     | +2  |     |     |     | +20 |     |     |     |     | 2      | 805   |
|  22 | Школа 28 - Команда 3 (Черемисинова, Голощапова, Раскопина), Киров |     | +   |     |     |     | -4  |     | -3  |     |     | 1      | 23    |
|   3 | ITL1 (Ахметшин, Сабиров, Субхангулов), Казань                     |     | +   |     |     |     | -6  |     |     |     |     | 1      | 45    |
|  21 | Школа 28 - Команда 2 (Бородавкин, Михолап, Козловских), Киров     |     | +   |     | -1  | -1  | -1  |     | -2  |     |     | 1      | 66    |
|   9 | Talking Hamsters (Исупова, Похвищева, Гасников), Киров            |     | -1  |     |     |     | -4  |     |     |     |     | 0      | 0     |
|  14 | КЭПЛ - 1 (Фролова, Тупий, Перминов), Киров                        |     | -9  |     |     |     | -12 |     |     |     |     | 0      | 0     |
|  20 | Школа 28 - Команда 1 (Лагунова, Ошуркова, Климова), Киров         |     | -2  |     |     |     |     |     | -5  |     |     | 0      | 0     |
|  25 | ПРО_граммисты_без_пробелов (Шустов), Киров                        |     | -1  |     |     |     | -3  |     |     |     |     | 0      | 0     |
|-----+-------------------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+--------+-------|

** Материалы

+ [[http://neerc.ifmo.ru/school/archive/2013-2014.html#spb-team][Материалы авторов задач]]
+ [[./2013-runs.7z][Архив подходов участников]]

{{{end-block}}}
