bricks/olymp/olymp/contest.kpml/2013.html
<div class="Page">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Открытая олимпиада КФМЛ «Командный турнир по программированию»</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>27 октября 2013 года</b> состоялась XVI открытая олимпиада КФМЛ
«Командный турнир по программированию». Она проходила в один день и на
том же наборе задач, что и командный чемпионат школьников
Санкт-Петербурга по программированию.
</p>

<p>
По результатам олимпиады, пять первых команд получили право
участвовать во <a href="http://neerc.ifmo.ru/school/russia-team/index.html">Всероссийской командной</a> олимпиаде школьников по
программированию, которая состоится 23-24 ноября 2013 года в
Санкт-Петербурге и Барнауле.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Результаты</h3>
<div class="outline-text-3" id="text-1-1">
<table>


<colgroup>
<col  class="right">

<col  class="left">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">Команда</th>
<th scope="col" class="center">A</th>
<th scope="col" class="center">B</th>
<th scope="col" class="center">C</th>
<th scope="col" class="center">D</th>
<th scope="col" class="center">E</th>
<th scope="col" class="center">F</th>
<th scope="col" class="center">G</th>
<th scope="col" class="center">H</th>
<th scope="col" class="center">I</th>
<th scope="col" class="center">J</th>
<th scope="col" class="center">Задачи</th>
<th scope="col" class="center">Штраф</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">12</td>
<td class="left">Диванная аналитика (Волостнов, Мингалиев, Чернега), Казань</td>
<td class="center">2</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">1</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">2</td>
<td class="center">1</td>
<td class="center">+</td>
<td class="center">10</td>
<td class="center">1113</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left">LI2 - 1 (Архипов, Корчагин, Сабирзянов), Казань</td>
<td class="center">2</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">2</td>
<td class="center">&#xa0;</td>
<td class="center">4</td>
<td class="center">&#xa0;</td>
<td class="center">+</td>
<td class="center">8</td>
<td class="center">948</td>
</tr>

<tr>
<td class="right">17</td>
<td class="left">Лицей КФУ - 1 (Муравьев, Сайфутдинов, Яровиков), Казань</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">1</td>
<td class="center">&#xa0;</td>
<td class="center">-7</td>
<td class="center">&#xa0;</td>
<td class="center">10</td>
<td class="center">7</td>
<td class="center">865</td>
</tr>

<tr>
<td class="right">11</td>
<td class="left">Вятский тессеракт (Будин, Бураков, Кайсин), Киров+Кирово-Чепецк</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">4</td>
<td class="center">6</td>
<td class="center">+</td>
<td class="center">&#xa0;</td>
<td class="center">-4</td>
<td class="center">&#xa0;</td>
<td class="center">-2</td>
<td class="center">6</td>
<td class="center">1065</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left">KRFMLI#1 (Мальцев, Зиновьева, Рябинина), Сыктывкар</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">&#xa0;</td>
<td class="center">1</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">&#xa0;</td>
<td class="center">-4</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">5</td>
<td class="center">344</td>
</tr>

<tr>
<td class="right">19</td>
<td class="left">Лицей КФУ - 3 (Захаров, Жданова, Китаева), Казань</td>
<td class="center">&#xa0;</td>
<td class="center">1</td>
<td class="center">-13</td>
<td class="center">3</td>
<td class="center">3</td>
<td class="center">+</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">4</td>
<td class="center">578</td>
</tr>

<tr>
<td class="right">18</td>
<td class="left">Лицей КФУ - 2 (Лагутин, Сайфутдинов, Сахабиев), Казань</td>
<td class="center">&#xa0;</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">3</td>
<td class="center">-10</td>
<td class="center">4</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">4</td>
<td class="center">652</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left">KRFMLI#2 (Тупикина, Мишенёв, Серов), Сыктывкар</td>
<td class="center">&#xa0;</td>
<td class="center">+</td>
<td class="center">-3</td>
<td class="center">4</td>
<td class="center">2</td>
<td class="center">5</td>
<td class="center">&#xa0;</td>
<td class="center">-5</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">4</td>
<td class="center">812</td>
</tr>

<tr>
<td class="right">8</td>
<td class="left">LI2 - 2 (Абдумуталов, Колычев, Мустафин), Казань</td>
<td class="center">-2</td>
<td class="center">+</td>
<td class="center">-3</td>
<td class="center">-3</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">3</td>
<td class="center">184</td>
</tr>

<tr>
<td class="right">16</td>
<td class="left">Лицей 33 (Шарифзянов, Ибрагимов, Проскуряков), Казань</td>
<td class="center">&#xa0;</td>
<td class="center">+</td>
<td class="center">&#xa0;</td>
<td class="center">2</td>
<td class="center">-3</td>
<td class="center">+</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">3</td>
<td class="center">299</td>
</tr>

<tr>
<td class="right">1</td>
<td class="left">Gym122 (Кузьмин, Галеева, Староверов), Казань</td>
<td class="center">&#xa0;</td>
<td class="center">+</td>
<td class="center">&#xa0;</td>
<td class="center">+</td>
<td class="center">-8</td>
<td class="center">5</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">-2</td>
<td class="center">&#xa0;</td>
<td class="center">3</td>
<td class="center">406</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left">ION (Шелестов, Захаров, Астафьев), Казань</td>
<td class="center">&#xa0;</td>
<td class="center">2</td>
<td class="center">&#xa0;</td>
<td class="center">-5</td>
<td class="center">-2</td>
<td class="center">1</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">2</td>
<td class="center">145</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left">LI - 7 (Азимуратов, Гумеров, Кидрачёв), Казань</td>
<td class="center">&#xa0;</td>
<td class="center">+</td>
<td class="center">&#xa0;</td>
<td class="center">-8</td>
<td class="center">-4</td>
<td class="center">3</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">2</td>
<td class="center">213</td>
</tr>

<tr>
<td class="right">13</td>
<td class="left">Картошка (Радаев, Васенин, Гурьев), Киров</td>
<td class="center">&#xa0;</td>
<td class="center">+</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">9</td>
<td class="center">&#xa0;</td>
<td class="center">-5</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">2</td>
<td class="center">617</td>
</tr>

<tr>
<td class="right">10</td>
<td class="left">Акбуре (Хайруллин, Султанов, Хайруллин), Казань</td>
<td class="center">&#xa0;</td>
<td class="center">2</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">20</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">2</td>
<td class="center">805</td>
</tr>

<tr>
<td class="right">22</td>
<td class="left">Школа 28 - Команда 3 (Черемисинова, Голощапова, Раскопина), Киров</td>
<td class="center">&#xa0;</td>
<td class="center">+</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">-4</td>
<td class="center">&#xa0;</td>
<td class="center">-3</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">1</td>
<td class="center">23</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left">ITL1 (Ахметшин, Сабиров, Субхангулов), Казань</td>
<td class="center">&#xa0;</td>
<td class="center">+</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">-6</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">1</td>
<td class="center">45</td>
</tr>

<tr>
<td class="right">21</td>
<td class="left">Школа 28 - Команда 2 (Бородавкин, Михолап, Козловских), Киров</td>
<td class="center">&#xa0;</td>
<td class="center">+</td>
<td class="center">&#xa0;</td>
<td class="center">-1</td>
<td class="center">-1</td>
<td class="center">-1</td>
<td class="center">&#xa0;</td>
<td class="center">-2</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">1</td>
<td class="center">66</td>
</tr>

<tr>
<td class="right">9</td>
<td class="left">Talking Hamsters (Исупова, Похвищева, Гасников), Киров</td>
<td class="center">&#xa0;</td>
<td class="center">-1</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">-4</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">0</td>
<td class="center">0</td>
</tr>

<tr>
<td class="right">14</td>
<td class="left">КЭПЛ - 1 (Фролова, Тупий, Перминов), Киров</td>
<td class="center">&#xa0;</td>
<td class="center">-9</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">-12</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">0</td>
<td class="center">0</td>
</tr>

<tr>
<td class="right">20</td>
<td class="left">Школа 28 - Команда 1 (Лагунова, Ошуркова, Климова), Киров</td>
<td class="center">&#xa0;</td>
<td class="center">-2</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">-5</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">0</td>
<td class="center">0</td>
</tr>

<tr>
<td class="right">25</td>
<td class="left">ПРО_граммисты_без_пробелов (Шустов), Киров</td>
<td class="center">&#xa0;</td>
<td class="center">-1</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">-3</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">&#xa0;</td>
<td class="center">0</td>
<td class="center">0</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Материалы</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="http://neerc.ifmo.ru/school/archive/2013-2014.html#spb-team">Материалы авторов задач</a>
</li>
<li><a href="./2013-runs.7z">Архив подходов участников</a>
</li>
</ul>
</div>
</div>
</div>
